TBL/STRATEGY_IV/CASE/0/theta
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      theta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 1.0;

boundaryField
{
    inlet
    {   
        type            fixedValue;
        value           uniform 1.0;
    }
    
    outlet
    {   
        type            zeroGradient;
    }
    
    "(lowerWall)"
    {   
        type            fixedValue;
        value           uniform 0.0; 
    }

    frontAndBack
    {
        type            empty;
    }

    "(upperWall|lowerWallSym)"
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
