TBL/STRATEGY_IV/CASE/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          215040;
        startFace       214288;
    }
    inlet
    {
        type            patch;
        nFaces          192;
        startFace       429328;
    }
    outlet
    {
        type            patch;
        nFaces          192;
        startFace       429520;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          512;
        startFace       429712;
    }
    lowerWallSym
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          48;
        startFace       430224;
    }
    upperWall
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          560;
        startFace       430272;
    }
)

// ************************************************************************* //
