TBL/STRATEGY_IV/CASE/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-20  -0 0)
    ( 220 -0 0)
    ( 220  50 0)
    (-20   50 0)
    (-20  -0 1.00)
    ( 220 -0 1.00)
    ( 220  50 1.00)
    (-20   50 1.00)
//
    (-40  -0  0)
    (-40   50 0)
    (-40  -0  1.00)
    (-40   50 1.00)
);

blocks
(
    hex (0 1 2 3  4 5 6  7) (512 192 1) simpleGrading (12  1250 1)
    hex (8 0 3 9 10 4 7 11) ( 48 192 1) simpleGrading (0.1 1250 1)
);

boundary
(
    frontAndBack
    {
        type empty;
        faces
        (
           (0 3 2 1)
           (8 9 3 0)
           (4 5 6 7)
           (10 4 7 11)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (8 10 11 9)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (1 5 4  0)
        );
    }
    lowerWallSym
    {
        type symmetryPlane;
        faces
        (
            (0 4 10 8)
        );
    }
    upperWall
    {
        type symmetryPlane;
        faces
        (
            (3 7  6 2)
            (9 11 7 3)
        );
    }
);

// ************************************************************************* //
