TBL/STRATEGY_IV/CASE/system/sampleDict.cfg
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

interpolationScheme cellPoint;

setFormat   raw;

setConfig
{
    type    lineUniform; // lineCell, lineCellFace
    axis    distance;    // x, y, z, xyz
    nPoints 100;
}

// ************************************************************************* //
